app/controllers/admin/dashboard_controller.rb

    def index
      @today_orders   = Order.today.count
      @today_revenue  = Order.today.revenue.sum(:grand_total)
      @pending_orders = Order.where(status: :pending).count
      @paid_orders    = Order.where(status: :paid).count
      @low_stock      = Product.published.low_stock.includes(:images_attachments).limit(10)
      @recent_orders  = Order.recent.includes(:user, :order_items).limit(10)
---
SELECT COUNT(*) FROM "orders" WHERE "orders"."created_at" >= '2026-02-19 06:00:00'
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 0
SELECT COUNT(*) FROM "orders" WHERE "orders"."status" = 1
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (30, 29, 28, 27, 26, 25, 24, 23, 22, 21)
SELECT "orders".* FROM "orders" ORDER BY "orders"."created_at" DESC LIMIT 10
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 8, 6, 4)