app/controllers/admin/orders_controller.rb

      scope = Order.includes(:user, :order_items, :delivery_zone, :assigned_to)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 19, 18, 14, 13, 15)
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 8, 6, 4, 7)

      scope      = scope.reorder("orders.#{@sort} #{@direction}")

      @pagy, @orders = pagy(:offset, scope, limit: 25)
      @status_counts = Order.group(:status).count
---
SELECT COUNT(*) FROM "orders" WHERE (order_number ILIKE '%franeck%' OR guest_email ILIKE '%franeck%' OR guest_name ILIKE '%franeck%')

    def show
      @order_items      = @order.order_items.includes(:product)
      @delivery_admins  = User.where(role: :admin, admin_kind: :delivery).order(:first_name)
      @delivery_events  = @order.delivery_events.includes(:created_by).order(created_at: :asc)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 30
SELECT "products".* FROM "products" WHERE "products"."id" IN (47, 122)
SELECT "users".* FROM "users" WHERE "users"."role" = 1 AND "users"."admin_kind" = 1 ORDER BY "users"."first_name" ASC
SELECT "delivery_events".* FROM "delivery_events" WHERE "delivery_events"."order_id" = 29 ORDER BY "delivery_events"."created_at" ASC

    def create
      authorize Order, :create?
      result = Orders::AdminCreate.call(params: order_create_params, admin: current_user)

      if result.success?
        OrderMailer.confirmation(result.order).deliver_now if result.order.customer_email.present?
        redirect_to admin_order_path(result.order), notice: "Order #{result.order.order_number} created successfully."
---
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 30 LIMIT 1
SELECT "orders".* FROM "orders" WHERE "orders"."id" = 31 LIMIT 1

    def update_status
      new_status = params[:status].to_sym

      unless @order.allowed_next_statuses.include?(new_status)
        redirect_to admin_order_path(@order), alert: "Invalid status transition."
        return
      end

      attrs = { status: new_status }
      if new_status == :delivered
        attrs[:delivered_at] = Time.current
        attrs[:delivered_by] = current_user
      end

      if @order.update(attrs)
---
UPDATE "orders" SET "status" = 4, "updated_at" = '2026-02-20 20:53:19.416236' WHERE "orders"."id" = 29

    def assign_delivery
      authorize @order, :assign?
      assigned_to = User.find(params[:assigned_to_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1