app/controllers/admin/products_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 2)
---
      scope = Product.includes(:category, :images_attachments)

SELECT "categories".* FROM "categories" WHERE "categories"."id" = 23
---
      scope      = scope.reorder("#{@sort} #{@direction}")

      @pagy, @products = pagy(:offset, scope, limit: 25)

      # When color is filtered, restrict categories + statuses to those with that color
      if params[:color].present?
        color_scope        = Product.where(color: params[:color])
        @categories        = Category.where(id: color_scope.select(:category_id)).order(:name)
        @available_statuses = color_scope.distinct.pluck(:status)
      else
        @categories         = Category.ordered