app/controllers/admin/purchase_orders_controller.rb

  def new
    authorize PurchaseOrder, :new?
    @po       = PurchaseOrder.new(status: :submitted, ordered_at: Date.current)
    @products = Product.where.not(status: :archived).order(:name)
---
SELECT "products".* FROM "products" WHERE "products"."status" = 1 ORDER BY "products"."name" ASC