app/controllers/admin/purchase_orders_controller.rb

SELECT "purchase_order_items".* FROM "purchase_order_items" WHERE "purchase_order_items"."purchase_order_id" = 2
SELECT 1 AS one FROM "purchase_orders" LIMIT 1 OFFSET 0
---
    scope = policy_scope(PurchaseOrder)
              .includes(:created_by, :purchase_order_items)
              .recent

    if params[:status].present? && PurchaseOrder.statuses.key?(params[:status])

SELECT COUNT(*) AS "count_all", "purchase_orders"."status" AS "purchase_orders_status" FROM "purchase_orders" GROUP BY "purchase_orders"."status"
---
    scope      = scope.reorder("purchase_orders.#{@sort} #{@direction}")

    @pagy, @purchase_orders = pagy(:offset, scope, limit: 25)
    @status_counts = PurchaseOrder.group(:status).count

SELECT "products".* FROM "products" WHERE "products"."id" IN (182, 183, 184, 185, 186, 187, 188, 189, 190, 191)
SELECT "purchase_order_items".* FROM "purchase_order_items" WHERE "purchase_order_items"."purchase_order_id" = 2 ORDER BY "purchase_order_items"."product_name" ASC
---
  def show
    authorize @po
    @items = @po.purchase_order_items.includes(:product).order(:product_name)

INSERT INTO "products" ("name", "brand", "sku", "slug", "category_id", "short_description", "base_cost", "markup_percentage", "selling_price", "stock_quantity", "status", "featured", "weight", "dimensions", "material", "color", "created_at", "updated_at", "qr_token") VALUES ('Six Drawer Dresser', 'Gerridan', 'B1190-31', 'six-drawer-dresser', 23, 'White/Gray', 189.5, 35.0, 255.83, 0, 0, FALSE, NULL, '{}', NULL, NULL, '2026-02-21 15:59:46.751582', '2026-02-21 15:59:46.751582', '-Gp8MI3JFShweFtee_KEjQ') RETURNING "id"
INSERT INTO "purchase_orders" ("reference_number", "status", "ordered_at", "notes", "created_by_id", "created_at", "updated_at") VALUES ('123', 1, '2026-02-21', NULL, 2, '2026-02-21 16:00:00.417293', '2026-02-21 16:00:00.417293') RETURNING "id"
UPDATE "products" SET "name" = 'Page not found', "updated_at" = '2026-02-21 15:59:48.251932' WHERE "products"."id" = 182
SELECT COUNT(*) FROM "purchase_order_items" WHERE "purchase_order_items"."purchase_order_id" = 2
---
  def import_screenshot
    authorize PurchaseOrder, :import_screenshot?
    return if request.get?

    unless params[:file].present?
      flash.now[:alert] = "Please select an image file."
      return render :import_screenshot, status: :unprocessable_entity
    end

    unless params[:reference_number].present?
      flash.now[:alert] = "Reference number is required."
      return render :import_screenshot, status: :unprocessable_entity
    end

    result = PurchaseOrders::ImportScreenshot.call(
      file:             params[:file],
      reference_number: params[:reference_number],
      ordered_at:       params[:ordered_at].presence,
      notes:            params[:notes].presence,
      created_by:       current_user
    )

    if result.success?
      parts = []
      parts << "#{result.created_products.size} new product(s) created as draft" if result.created_products.any?
      parts << "#{result.updated_products.size} product(s) updated"               if result.updated_products.any?
      parts << "#{result.skipped_rows.size} row(s) skipped"                       if result.skipped_rows.any?

      notice = "PO #{result.purchase_order.reference_number} imported — #{result.purchase_order.purchase_order_items.size} items. #{parts.join(', ')}."

SELECT "purchase_orders".* FROM "purchase_orders" WHERE "purchase_orders"."id" = 2 LIMIT 1
---
  def set_purchase_order
    @po = PurchaseOrder.find(params[:id])