app/controllers/admin/settings_controller.rb

SELECT "global_settings".* FROM "global_settings"
---
    def show
      @settings = GlobalSetting.all.index_by(&:key)