app/views/admin/purchase_orders/index.html.erb

            <td class="px-6 py-4 text-center text-sm text-gray-600">
              <%= po.purchase_order_items.size %>
---
SELECT COUNT(*) FROM "purchase_orders"
SELECT "purchase_order_items".* FROM "purchase_order_items" WHERE "purchase_order_items"."purchase_order_id" = 2