app/views/admin/purchase_orders/show.html.erb

          <% @items.each do |item| %>
            <% thumb = item.product&.vendor_image_urls&.first %>
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (182, 183, 184, 185, 186, 187, 188, 189, 190, 191)