app/views/delivery/orders/index.html.erb

            <td class="px-6 py-4 text-sm text-gray-600">
              <%= order.order_items.sum(:quantity) %> item(s)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (31, 27, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT SUM("order_items"."quantity") FROM "order_items" WHERE "order_items"."order_id" = 31