app/views/delivery/orders/show.html.erb

                <td class="px-6 py-4 text-sm text-gray-600">
                  <% if item.product&.dimensions.present? && item.product.dimensions.any? %>
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (10, 160)