app/views/admin/orders/index.html.erb

SELECT COUNT(*) FROM "orders" WHERE (order_number ILIKE '%franeck%' OR guest_email ILIKE '%franeck%' OR guest_name ILIKE '%franeck%')
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (31, 30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1, 19, 18, 14, 13)
SELECT COUNT(*) FROM "order_items" WHERE "order_items"."order_id" = 31
---
            <%= link_to order.order_number, admin_order_path(order), class: "text-sm font-mono font-medium text-amber-700 hover:underline" %>
            <p class="text-xs text-gray-400"><%= order.order_items.count %> items</p>