app/views/admin/orders/show.html.erb

          <% @order_items.each do |item| %>
            <% othumb = item.product&.vendor_image_urls&.first %>
---
SELECT "products".* FROM "products" WHERE "products"."id" IN (47, 122)