app/services/purchase_orders/import_screenshot.rb

SELECT "products".* FROM "products" WHERE "products"."sku" = 'B1190-31' LIMIT 1
---
          series      = item["series"].to_s.strip
          color       = item["color"].to_s.strip

          product = Product.find_by(sku: sku)

INSERT INTO "products" ("name", "brand", "sku", "slug", "category_id", "short_description", "base_cost", "markup_percentage", "selling_price", "stock_quantity", "status", "featured", "weight", "dimensions", "material", "color", "created_at", "updated_at", "qr_token") VALUES ('Six Drawer Dresser', 'Gerridan', 'B1190-31', 'six-drawer-dresser', 23, 'White/Gray', 189.5, 35.0, 255.83, 0, 0, FALSE, NULL, '{}', NULL, NULL, '2026-02-21 15:59:46.751582', '2026-02-21 15:59:46.751582', '-Gp8MI3JFShweFtee_KEjQ') RETURNING "id"
INSERT INTO "categories" ("name", "slug", "parent_id", "position", "created_at", "updated_at") VALUES ('Ashley Furniture', 'ashley-furniture', NULL, 0, '2026-02-21 15:59:46.715211', '2026-02-21 15:59:46.715211') RETURNING "id"
SELECT "categories".* FROM "categories" WHERE "categories"."name" = 'Ashley Furniture' LIMIT 1
INSERT INTO "products" ("name", "brand", "sku", "slug", "category_id", "short_description", "base_cost", "markup_percentage", "selling_price", "stock_quantity", "status", "featured", "weight", "dimensions", "material", "color", "created_at", "updated_at", "qr_token") VALUES ('STARWOOD MOTION SOFA BROWN TWO TONE CONTRAST STITCHING W/ DROP DOWN TRAY W/ WIRELESS CHARGER LEATHER GEL (TARIFF INCL)', NULL, '691320', 'starwood-motion-sofa-brown-two-tone-contrast-stitching-w-drop-down-tray-w-wireless-charger-leather-gel-tariff-incl', 23, NULL, 510.0, 35.0, 688.5, 1, 0, FALSE, NULL, '{}', NULL, 'BROWN', '2026-02-21 17:02:28.260951', '2026-02-21 17:02:28.260951', 'nRhqIcyHeF3-rVK78xUKBA') RETURNING "id"
---
            updates[:color] = color        if color.present? && product.color != color
            product.update!(updates) if updates.any?
            product.increment!(:stock_quantity, qty)
            updated_products << product unless updated_products.include?(product)
          else
            ashley_category ||= Category.find_or_create_by!(name: "Ashley Furniture")
            product = Product.create!(
              sku:            sku,
              name:           description.presence || sku,
              brand:          series.presence,
              color:          color.presence,
              base_cost:      price,
              stock_quantity: qty,
              status:         :draft,
              category:       ashley_category
            )

INSERT INTO "purchase_orders" ("reference_number", "status", "ordered_at", "notes", "created_by_id", "created_at", "updated_at") VALUES ('Generation-1', 1, '2026-02-21', NULL, 2, '2026-02-21 17:02:29.321427', '2026-02-21 17:02:29.321427') RETURNING "id"
INSERT INTO "purchase_order_items" ("purchase_order_id", "product_id", "quantity_ordered", "quantity_received", "unit_cost", "product_name", "product_sku", "created_at", "updated_at") VALUES (3, 192, 1, 0, 510.0, 'STARWOOD MOTION SOFA BROWN TWO TONE CONTRAST STITCHING W/ DROP DOWN TRAY W/ WIRELESS CHARGER LEATHER GEL (TARIFF INCL)', '691320', '2026-02-21 17:02:29.325686', '2026-02-21 17:02:29.325686') RETURNING "id"
---

        raise "No valid line items found in the image." if line_items.empty?

        po = PurchaseOrder.create!(
          reference_number: @reference_number,
          status:           :submitted,
          ordered_at:       @ordered_at,
          notes:            @notes,
          created_by:       @created_by
        )

        line_items.each { |attrs| po.purchase_order_items.create!(attrs) }