app/services/purchase_orders/receive_items.rb

SELECT "purchase_orders".* FROM "purchase_orders" WHERE "purchase_orders"."id" = 1 LIMIT 1
SELECT "purchase_order_items".* FROM "purchase_order_items" WHERE "purchase_order_items"."purchase_order_id" = 1 AND "purchase_order_items"."id" = 1 LIMIT 1
UPDATE "purchase_order_items" SET "quantity_received" = 3, "unit_cost" = 295.0, "updated_at" = '2026-02-21 14:43:01.711097' WHERE "purchase_order_items"."id" = 1
UPDATE "products" SET "base_cost" = 295.0, "selling_price" = 398.25, "stock_quantity" = 6, "updated_at" = '2026-02-21 14:43:01.730302' WHERE "products"."id" = 2
UPDATE "purchase_orders" SET "status" = 2, "updated_at" = '2026-02-21 14:43:01.740786' WHERE "purchase_orders"."id" = 1
---
    def call
      ActiveRecord::Base.transaction do
        @receive_params.each do |item_id, attrs|
          qty           = attrs[:qty_to_receive].to_i
          selling_price = attrs[:selling_price].to_d
          next if qty <= 0

          item = @purchase_order.purchase_order_items.find(item_id)
          cost = item.unit_cost # Use the PO's fixed unit cost

          item.update!(
            quantity_received: item.quantity_received + qty
          )

          # Update stock quantity and sync base_cost from PO unit_cost
          # Then update selling price (which also updates markup_percentage)
          product = item.product
          product.update!(
            base_cost:      cost,
            stock_quantity: product.stock_quantity + qty
          )
          product.update_selling_price(selling_price) if selling_price > 0
        end

        @purchase_order.reload
        new_status = @purchase_order.fully_received? ? :received : :partially_received
        @purchase_order.update!(status: new_status)