app/controllers/qr/products_controller.rb

    def show
      @product = Product.find_by!(qr_token: params[:token])
---
SELECT "products".* FROM "products" WHERE "products"."qr_token" = 'R1Jf-U2mI2bgaVCudlqRhg' LIMIT 1