app/services/orders/assign_delivery.rb

    def self.call(order:, assigned_to:, assigned_by:)
      ActiveRecord::Base.transaction do
        order.update!(assigned_to: assigned_to)
        order.delivery_events.create!(
          status:     :assigned,
          created_by: assigned_by,
          note:       "Assigned to #{assigned_to.full_name}"
        )
---
UPDATE "orders" SET "updated_at" = '2026-02-21 03:25:48.973713', "assigned_to_id" = 10 WHERE "orders"."id" = 31
INSERT INTO "delivery_events" ("order_id", "status", "note", "created_by_id", "created_at", "updated_at") VALUES (31, 0, 'Assigned to Delivery  Man', 2, '2026-02-21 03:25:48.977267', '2026-02-21 03:25:48.977267') RETURNING "id"