app/controllers/account/orders_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = 2 ORDER BY "orders"."created_at" DESC LIMIT 10 OFFSET 0
---
    def index
      @pagy, @orders = pagy(:offset, current_user.orders.recent, limit: 10)