app/views/carts/show.html.erb

SELECT "products".* FROM "products" WHERE "products"."id" = 2
---
            <div class="w-24 h-24 bg-gray-100 rounded-lg overflow-hidden flex-shrink-0">
              <% if item.product.vendor_image_urls.present? %>