app/views/checkouts/show.html.erb

SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2
---
        <div class="space-y-3 mb-4">
          <% current_cart.cart_items.includes(:product).each do |item| %>

SELECT "products".* FROM "products" WHERE "products"."id" = 2
---
              <div class="w-12 h-12 bg-gray-100 rounded-md overflow-hidden flex-shrink-0">
                <% if item.product.vendor_image_urls.present? %>