app/controllers/application_controller.rb

  def find_or_create_cart
    if user_signed_in?
      current_user.cart || current_user.create_cart!
    else
      if session[:cart_id]
        Cart.find_by(id: session[:cart_id]) || create_guest_cart
---
INSERT INTO "carts" ("user_id", "session_id", "created_at", "updated_at") VALUES (NULL, 'eecfd4e9978ddeef7da1572fa4ab9397', '2026-02-20 05:07:46.981247', '2026-02-20 05:07:46.981247') RETURNING "id"
SELECT "carts".* FROM "carts" WHERE "carts"."id" = 1 LIMIT 1