app/controllers/carts_controller.rb

  def show
    @cart_items = current_cart.cart_items.includes(:product)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2

  def add_item
    product = Product.published.find(params[:product_id])
    quantity = params.fetch(:quantity, 1).to_i
    quantity = [quantity, 1].max

    item = current_cart.cart_items.find_or_initialize_by(product: product)
---
SELECT "cart_items".* FROM "cart_items" WHERE "cart_items"."cart_id" = 2 AND "cart_items"."product_id" = 2 LIMIT 1