app/controllers/categories_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."slug" = 'bedroom' LIMIT 1
---
  def show
    @category = Category.friendly.find(params[:slug])