app/controllers/checkouts_controller.rb

  def show
    @default_address = current_user.addresses.find_by(is_default: true) if user_signed_in?
---
SELECT "addresses".* FROM "addresses" WHERE "addresses"."user_id" = 2 AND "addresses"."is_default" = TRUE LIMIT 1