app/controllers/pages_controller.rb

SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (2, 8)
---
  def home
    @featured_products = Product.published.featured.includes(:images_attachments, :category).limit(8)