app/controllers/products_controller.rb

    scope = Product.published.includes(:category, :images_attachments)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" IN (8, 2)