app/models/cart.rb

SELECT "products".* FROM "products" WHERE "products"."id" = 2
---
  def subtotal
    cart_items.includes(:product).sum { |item| item.product.selling_price * item.quantity }