app/models/delivery_zone.rb

  def self.find_by_zip(zip)
    active.where("? = ANY(zip_codes)", zip.to_s.strip).first
---
SELECT "delivery_zones".* FROM "delivery_zones" WHERE "delivery_zones"."active" = TRUE AND ('76541' = ANY(zip_codes)) ORDER BY "delivery_zones"."id" ASC LIMIT 1