app/models/global_setting.rb

  def self.[](key)
    find_by(key: key.to_s)&.value
---
SELECT "global_settings".* FROM "global_settings" WHERE "global_settings"."key" = 'global_markup_percentage' LIMIT 1