app/models/order.rb

  def generate_order_number
    loop do
      self.order_number = "KF-#{Time.current.year}-#{SecureRandom.alphanumeric(8).upcase}"
      break unless Order.exists?(order_number: order_number)
---
SELECT 1 AS one FROM "orders" WHERE "orders"."order_number" = 'KF-2026-4U8J0KWX' LIMIT 1