app/views/categories/show.html.erb

SELECT "categories"."id" FROM "categories" WHERE "categories"."parent_id" = 12
---
    <!-- Sub-category chips -->
    <% nav_subcats = @category.parent ? @category.parent.subcategories.ordered : @category.subcategories.ordered %>