app/services/products/fetch_from_ashley.rb

    def apply_updates(data)
      updates = {}
      updates[:name]   = data[:name]   if data[:name].present? && @product.name != data[:name]
      updates[:weight] = data[:weight] if data[:weight].present? && @product.weight.nil?

      @product.update!(updates) if updates.any?
---
UPDATE "products" SET "name" = 'Page not found', "updated_at" = '2026-02-21 15:59:48.251932' WHERE "products"."id" = 182