app/controllers/users/sessions_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = 3 LIMIT 1
---
  def merge_session_cart_into_user(user)
    return unless session[:cart_id]

    session_cart = Cart.find_by(id: session[:cart_id])