app/controllers/delivery/orders_controller.rb

      scope = policy_scope(Order)
               .where(status: @status_filter)
               .includes(:order_items, :user, :assigned_to)
               .recent
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" IN (30, 29, 28, 27, 26, 25, 24, 23, 22, 21, 10, 9, 8, 7, 6, 5, 4, 3, 2, 1)
SELECT "users".* FROM "users" WHERE "users"."id" IN (5, 8, 6, 4)

    def show
      authorize @order
      @order_items     = @order.order_items.includes(:product)
      @delivery_events = @order.delivery_events.includes(:created_by).order(created_at: :asc)
---
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = 27
SELECT "products".* FROM "products" WHERE "products"."id" IN (176, 123, 55)
SELECT "delivery_events".* FROM "delivery_events" WHERE "delivery_events"."order_id" = 7 ORDER BY "delivery_events"."created_at" ASC